In [1]:
import pandas as pd

In [2]:
dados = {'emprego':['Administrador_banco_de_dados', 'Prorgamador', 'Arquiteto_de_redes'],
        'new_jersey':[97350, 82080, 112840],
        'florida':[77140, 71540, 62310]}

In [5]:
type(dados)

# Tipo da variável

dict

In [7]:
dataset = pd.DataFrame(dados)

# Criando um dataframe

In [9]:
dataset

# Dataframe criado

                        emprego  new_jersey  florida
0  Administrador_banco_de_dados       97350    77140
1                   Prorgamador       82080    71540
2            Arquiteto_de_redes      112840    62310

In [11]:
dataset['new_jersey'].sum()

# Somando os valores da coluna new jersey

292270

In [13]:
dataset['florida'].sum()

# Somando valores da coluna florida

210990

In [17]:
dataset['%_new_jersey'] = (dataset['new_jersey'] / dataset['new_jersey'].sum() * 100)

# Calculando a porcentagem disponível para cada valor do dataset

In [18]:
dataset

                        emprego  new_jersey  florida  %_new_jersey
0  Administrador_banco_de_dados       97350    77140     33.308242
1                   Prorgamador       82080    71540     28.083621
2            Arquiteto_de_redes      112840    62310     38.608136

In [19]:
dataset['%_florida'] = (dataset['florida'] / dataset['florida'].sum() * 100)

In [20]:
dataset

                        emprego  new_jersey  florida  %_new_jersey  %_florida
0  Administrador_banco_de_dados       97350    77140     33.308242  36.560974
1                   Prorgamador       82080    71540     28.083621  33.906820
2            Arquiteto_de_redes      112840    62310     38.608136  29.532205

------------------------------------------------------------------------

# Vamos trabalhar com os dados do census e observar alguma relação do education e o atributo income

In [21]:
dados = pd.read_csv('census.csv')

In [22]:
dados.head()

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [30]:
dt = dados[['education','income']]

dataframe = pd.DataFrame(dt)

In [31]:
dataframe

         education  income
0        Bachelors   <=50K
1        Bachelors   <=50K
2          HS-grad   <=50K
3             11th   <=50K
4        Bachelors   <=50K
...            ...     ...
32556   Assoc-acdm   <=50K
32557      HS-grad    >50K
32558      HS-grad   <=50K
32559      HS-grad   <=50K
32560      HS-grad    >50K

[32561 rows x 2 columns]

In [40]:
dataset3 = dataframe.groupby(['education', 'income'])['education'].count()

In [43]:
dataset3.index

MultiIndex([(        ' 10th', ' <=50K'),
            (        ' 10th',  ' >50K'),
            (        ' 11th', ' <=50K'),
            (        ' 11th',  ' >50K'),
            (        ' 12th', ' <=50K'),
            (        ' 12th',  ' >50K'),
            (     ' 1st-4th', ' <=50K'),
            (     ' 1st-4th',  ' >50K'),
            (     ' 5th-6th', ' <=50K'),
            (     ' 5th-6th',  ' >50K'),
            (     ' 7th-8th', ' <=50K'),
            (     ' 7th-8th',  ' >50K'),
            (         ' 9th', ' <=50K'),
            (         ' 9th',  ' >50K'),
            (  ' Assoc-acdm', ' <=50K'),
            (  ' Assoc-acdm',  ' >50K'),
            (   ' Assoc-voc', ' <=50K'),
            (   ' Assoc-voc',  ' >50K'),
            (   ' Bachelors', ' <=50K'),
            (   ' Bachelors',  ' >50K'),
            (   ' Doctorate', ' <=50K'),
            (   ' Doctorate',  ' >50K'),
            (     ' HS-grad', ' <=50K'),
            (     ' HS-grad',  ' >50K'),
            (     ' Masters', ' <=50K'),
            (     ' Masters',  ' >50K'),
            (   ' Preschool', ' <=50K'),
            ( ' Prof-school', ' <=50K'),
            ( ' Prof-school',  ' >50K'),
            (' Some-college', ' <=50K'),
            (' Some-college',  ' >50K')],
           names=['education', 'income'])

In [45]:
dataset3[' Bachelors',' <=50K'], dataset3[' Bachelors', ' >50K']

(3134, 2221)

In [46]:
Total = 3134 + 2221

In [48]:
# % > 50K

(2221 / Total) * 100

41.47525676937442

In [49]:
# % <=50K

(3134 / Total) * 100

58.52474323062559

### Estudando um pouco sobre Coeficientes e taxas

In [50]:
dt = {'ano': ['1', '2', '3', '4', 'total'],
     'matriculas_marco': [70, 50, 47, 23, 190],
     'matriculas_novembro': [65, 48, 40, 22, 175]}

In [51]:
dt

{'ano': ['1', '2', '3', '4', 'total'],
 'matriculas_marco': [70, 50, 47, 23, 190],
 'matriculas_novembro': [65, 48, 40, 22, 175]}

In [52]:
dt_dataframe = pd.DataFrame(dt)

In [53]:
dt_dataframe

     ano  matriculas_marco  matriculas_novembro
0      1                70                   65
1      2                50                   48
2      3                47                   40
3      4                23                   22
4  total               190                  175

In [56]:
# Coeficiente

dt_dataframe['coeficiente'] = ((dt_dataframe['matriculas_marco'] - dt_dataframe['matriculas_novembro']) / dt_dataframe['matriculas_marco'])


# Cálculo da taxa de evasão de discentes

dt_dataframe['taxa_evasao'] = ((dt_dataframe['matriculas_marco'] - dt_dataframe['matriculas_novembro']) / dt_dataframe['matriculas_marco']) * 100

In [57]:
dt_dataframe

     ano  matriculas_marco  matriculas_novembro  taxa_evasao  coeficiente
0      1                70                   65     7.142857     0.071429
1      2                50                   48     4.000000     0.040000
2      3                47                   40    14.893617     0.148936
3      4                23                   22     4.347826     0.043478
4  total               190                  175     7.894737     0.078947